#Область СлужебныеПроцедурыИФункции

Функция ДанныеОрганизацииЗаполнены() Экспорт
	
	ГенеральныйДиректор_Значение 		= Константы.ГенеральныйДиректор.Получить();
	ИНН_Значение 						= Константы.ИНН_Организации.Получить();
	НаименованиеОрганизации_Значение 	= Константы.НаименованиеОрганизации.Получить();
	
	НаименованиеОрганизации_Заполнено 	= НЕ ПустаяСтрока(НаименованиеОрганизации_Значение);
	ИНН_Заполнено 						= НЕ ПустаяСтрока (ИНН_Значение);
	ГенеральныйДиректор_Заполнено 		= (ГенеральныйДиректор_Значение <> Справочники.Сотрудники.ПустаяСсылка());
	
	Возврат НаименованиеОрганизации_Заполнено И ИНН_Заполнено И ГенеральныйДиректор_Заполнено;
	
КонецФункции

#КонецОбласти