
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Функция НачатьИгру(Команда)
#Если НЕ ВебКлиент Тогда	
	Генератор = Новый ГенераторСлучайныхЧисел();
	Объект.ЗагаданноеЧисло = Цел(Генератор.СлучайноеЧисло(0,1000));

    Вариант = 0;

	Объект.Вариант = Ждать ВвестиЧислоАсинх(Вариант,"Введите любое число от 1 до 1000", 4, 0);
		
	Если Объект.Вариант > 1000 Тогда
	
		ПредупреждениеАсинх("Число больше 1000! Попробуйте еще раз!");	
	    Возврат Истина;
	КонецЕсли; 
	
	Дельта = Объект.Вариант - Объект.ЗагаданноеЧисло;
	ДельтаМодуль = ?(Дельта > 0, Дельта, -Дельта);
	Если ДельтаМодуль < 10 Тогда 
		
		ПредупреждениеАсинх("Поздравляю, Вы выиграли! Загаданное число = " + Объект.ЗагаданноеЧисло);
			
	КонецЕсли;  
	
	ПредупреждениеАсинх ("Сожалею, Вы проиграли! Загаданное число = " + Объект.ЗагаданноеЧисло); 
#КонецЕсли
КонецФункции

#КонецОбласти
