
#Область ОбработчикиКомандФормы

#Если НЕ ВебКлиент Тогда
	
&НаКлиенте
Асинх Процедура НачатьИгру(Команда)
		
	Объект.Вариант = Ждать ВвестиЧислоАсинх(, "Введите любое число от 1 до 1000", 4, 0);
		
	Если Объект.Вариант > 1000 Тогда
		ПредупреждениеАсинх("Число больше 1000! Попробуйте еще раз!");	
	    Возврат;	    
	КонецЕсли; 
	
	Объект.ЗагаданноеЧисло = ГенераторСлучайногоЧисла();
	
	Дельта = Объект.Вариант - Объект.ЗагаданноеЧисло;
	ДельтаМодуль = ?(Дельта > 0, Дельта, -Дельта);
	
	Если ДельтаМодуль < 10 Тогда 
		ПредупреждениеАсинх("Поздравляю, Вы выиграли! Загаданное число = " + Объект.ЗагаданноеЧисло);
	КонецЕсли;  
	
	ПредупреждениеАсинх ("Сожалею, Вы проиграли! Загаданное число = " + Объект.ЗагаданноеЧисло); 
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если НЕ ВебКлиент Тогда
	
&НаКлиенте
Функция ГенераторСлучайногоЧисла()

	Генератор 			= Новый ГенераторСлучайныхЧисел();
	ЗагаданноеЧисло 	= Цел(Генератор.СлучайноеЧисло(0,1000));
	
	Возврат ЗагаданноеЧисло;

КонецФункции

#КонецЕсли

#КонецОбласти
