#Область ПрограммныйИнтерфейс

// Обработка открытия формы выбора - открывает Форму выбора по заданной структуре отбора.
// 
// Параметры:
// Период - Дата
// ФормаВыбора - Форма
// ЭлементФормы - ПолеФормы
// ПараметрОтбора - Структура
// Грузчик - СправочникСсылка
Процедура ОткрытьФормуВыбора(Период, ФормаВыбора, ЭлементФормы, Грузчик) Экспорт
    
    СтруктураПараметров = Новый Структура;
    
    Если Грузчик <> Неопределено Тогда
		СтруктураПараметров.Вставить("Грузчик", Грузчик); 
    КонецЕсли;
    
    СтруктураПараметров.Вставить("Период", Период); 
	СтруктураПараметров.Вставить("РежимВыбора", Истина); 

    ОткрытьФорму(ФормаВыбора, СтруктураПараметров, ЭлементФормы);
    
КонецПроцедуры

#КонецОбласти
