#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда

	    Запрос = Новый Запрос;
	    Запрос.Текст =
	    	"ВЫБРАТЬ
	    	|	СчетНаОплату.Контрагент,
	    	|	СчетНаОплату.Сумма КАК Сумма,
	    	|	СчетНаОплату.Ссылка КАК Основание
	    	|ИЗ
	    	|	Документ.СчетНаОплату КАК СчетНаОплату
	    	|ГДЕ
	    	|	СчетНаОплату.Ссылка = &Ссылка";
	    
	    Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	    РезультатЗапроса = Запрос.Выполнить();
	    
	    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	    ВыборкаДетальныеЗаписи.Следующий();
	    ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	    
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.БухгалтерскиеПроводки.Записывать = Истина;
	Движение = Движения.БухгалтерскиеПроводки.Добавить();
	Движение.СчетДт = ПланыСчетов.ПланыСчетовБухгалтерии.Касса;
	Движение.СчетКт = ПланыСчетов.ПланыСчетовБухгалтерии.Контрагент;
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;

КонецПроцедуры

#КонецЕсли

#КонецОбласти