
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, 
								ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка 	= Ложь;
	ТранспортныйОтделКлиент.ОткрытьФормуВыбора(НачалоДня(Объект.Дата), 
	"Справочник.Водители.Форма.ФормаВыбораВодителиВнеБригады", Элементы.Водитель, Неопределено);			

КонецПроцедуры

&НаКлиенте
Процедура ТранспортНачалоВыбора(Элемент, ДанныеВыбора, 
								ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ТранспортныйОтделКлиент.ОткрытьФормуВыбора(НачалоДня(Объект.Дата), 
	"Справочник.ТранспортныеСредства.Форма.ФормаВыбораТранспортБезБригады", Элементы.Транспорт, Неопределено);	
    
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикПервыйНачалоВыбора(Элемент, ДанныеВыбора, 
									ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	Грузчик = ГрузчикВДокументе(Объект.ГрузчикВторой);
	ТранспортныйОтделКлиент.ОткрытьФормуВыбора(НачалоДня(Объект.Дата), 
	"Справочник.Грузчики.Форма.ФормаВыбораГрузчикиВнеБригады", Элементы.ГрузчикПервый, Грузчик);
    
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикВторойНачалоВыбора(Элемент, ДанныеВыбора, 
									ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	Грузчик = ГрузчикВДокументе(Объект.ГрузчикПервый);
	ТранспортныйОтделКлиент.ОткрытьФормуВыбора(НачалоДня(Объект.Дата), 
	"Справочник.Грузчики.Форма.ФормаВыбораГрузчикиВнеБригады", Элементы.ГрузчикВторой, Грузчик);
    
КонецПроцедуры

&НаКлиенте
Процедура ВодительОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, 
								ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
    Объект.Водитель 		= ВыбранноеЗначение;
    
КонецПроцедуры

&НаКлиенте
Процедура ТранспортОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, 
								ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	Объект.Транспорт 		= ВыбранноеЗначение;
	Объект.НачальныйПробег 	= ПробегТранспорта(Объект.Транспорт);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикПервыйОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, 
								ВыборДобавлением, СтандартнаяОбработка)
   
    СтандартнаяОбработка 	= Ложь;
    Объект.ГрузчикПервый 	= ВыбранноеЗначение;
    
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикВторойОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, 
								ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
    Объект.ГрузчикВторой 	= ВыбранноеЗначение;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПробегТранспорта(Знач Транспорт)

	НачальныйПробег = РегистрыНакопления.ПробегТранспорта.ПробегТранспорта(Транспорт);
	Возврат НачальныйПробег; 
	
КонецФункции

&НаКлиенте
Функция ГрузчикВДокументе(Грузчик)
	
	Грузчик = Неопределено;
	
	Если НЕ Грузчик.Пустая() Тогда
		Грузчик = Грузчик;
	КонецЕсли;
	
	Возврат Грузчик;
	
КонецФункции

#КонецОбласти

