#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ПробегТранспорта(Транспорт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПробегТранспортаОбороты.РасстояниеОборот КАК Пробег
		|ИЗ
		|	РегистрНакопления.ПробегТранспорта.Обороты(,,, Транспорт = &Транспорт) КАК ПробегТранспортаОбороты";
	
	Запрос.УстановитьПараметр("Транспорт", Транспорт);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		НачальныйПробег	= 0;
		Возврат НачальныйПробег;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	НачальныйПробег 	= ВыборкаДетальныеЗаписи.Пробег;

	Возврат НачальныйПробег; 
	
КонецФункции

#КонецОбласти

#КонецЕсли