
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)    
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
 	Поля.Добавить("Родитель");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры                       

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.Родитель) Тогда
		Представление = Данные.Наименование + " (" + Строка(Данные.Родитель) + ")";
	Иначе
		Представление = Данные.Наименование;  
	КонецЕсли;
КонецПроцедуры




