#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
		
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Условие = НЕ ЗначениеЗаполнено(Водитель);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле Водитель должно быть заполнено");
	
	Условие = НЕ ЗначениеЗаполнено(ГрузчикПервый) ИЛИ НЕ ЗначениеЗаполнено(ГрузчикВторой);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле Грузчик должно быть заполнено");
	
	Условие = НЕ ЗначениеЗаполнено(Транспорт);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле Транспорт должно быть заполнено");	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
		
	ПроверяемыеРеквизиты = ЗаполнениеПроверяемыхРеквизитов();
	ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты);
	ЗаписьДвижений();
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Условие = Не ПредрейсовыйМедицинскийОсмотр;
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Водитель не имеет медицинского допуска!");
	
	Условие = НЕ ИнструктажПоТехникеБезопасности;
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Членам бригады не проведен инструктаж!");	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписьДвижений()
		
	Движения.СоставБригады.Записывать = Истина;
	Движение = Движения.СоставБригады.Добавить();
	Движение.Период = Дата;
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);	
		
КонецПроцедуры
	
Функция ЗаполнениеПроверяемыхРеквизитов()
	
	ПроверяемыеРеквизиты = Новый Массив;
	Возврат ПроверяемыеРеквизиты;
		
КонецФункции

#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли