#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокТоваров.Ссылка.Дата КАК Период,
		|	РасходнаяНакладнаяСписокТоваров.Ссылка.Клиент КАК Контрагент,
		|	РасходнаяНакладнаяСписокТоваров.Товар КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокТоваров.Количество) КАК Количество,
		|	СУММА(РасходнаяНакладнаяСписокТоваров.Сумма) КАК Сумма,
		|	ЛОЖЬ КАК Признак
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокТоваров КАК РасходнаяНакладнаяСписокТоваров
		|ГДЕ
		|	РасходнаяНакладнаяСписокТоваров.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокТоваров.Ссылка.Дата,
		|	РасходнаяНакладнаяСписокТоваров.Ссылка.Клиент,
		|	РасходнаяНакладнаяСписокТоваров.Товар
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокУслуг.Ссылка.Дата,
		|	РасходнаяНакладнаяСписокУслуг.Ссылка.Клиент,
		|	РасходнаяНакладнаяСписокУслуг.Услуга,
		|	КОЛИЧЕСТВО(РасходнаяНакладнаяСписокУслуг.Сумма),
		|	СУММА(РасходнаяНакладнаяСписокУслуг.Сумма),
		|	ИСТИНА
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокУслуг КАК РасходнаяНакладнаяСписокУслуг
		|ГДЕ
		|	РасходнаяНакладнаяСписокУслуг.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокУслуг.Ссылка.Дата,
		|	РасходнаяНакладнаяСписокУслуг.Ссылка.Клиент,
		|	РасходнаяНакладнаяСписокУслуг.Услуга";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
		Если РезультатЗапроса.Пустой() Тогда
		
			Возврат;
				
		КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Движения.Продажи.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
			Движение1 = Движения.Продажи.Добавить();
			ЗаполнитьЗначенияСвойств(Движение1, ВыборкаДетальныеЗаписи);

				Если НЕ ВыборкаДетальныеЗаписи.Признак Тогда
					
					Движение2 = Движения.ОстаткиНоменклатуры.Добавить();
					Движение2.ВидДвижения = ВидДвиженияНакопления.Расход;
					ЗаполнитьЗначенияСвойств(Движение2, ВыборкаДетальныеЗаписи);	
								
				КонецЕсли;		

		КонецЦикла;
	
	Движения.Продажи.Записать();
	Движения.ОстаткиНоменклатуры.Записать();
	
	Отказ = РегистрыНакопления.ОстаткиНоменклатуры.ПроверитьОтрицательныеОстаткиТовра(ЭтотОбъект.Ссылка, ЭтотОбъект.Дата);
	
КонецПроцедуры

#КонецОбласти

