#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ,Режим)
		
	Движения.Продажи.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокТоваров.Товар КАК Товар,
		|	СУММА(РасходнаяНакладнаяСписокТоваров.Количество) КАК КоличествоТовар,
		|	NULL КАК Услуга,
		|	NULL КАК КоличествоУслуга,
		|	СУММА(РасходнаяНакладнаяСписокТоваров.Сумма) КАК Сумма
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокТоваров КАК РасходнаяНакладнаяСписокТоваров
		|ГДЕ
		|	РасходнаяНакладнаяСписокТоваров.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокТоваров.Товар
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	РасходнаяНакладнаяСписокУслуг.Услуга,
		|	КОЛИЧЕСТВО(РасходнаяНакладнаяСписокУслуг.Сумма),
		|	СУММА(РасходнаяНакладнаяСписокУслуг.Сумма)
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокУслуг КАК РасходнаяНакладнаяСписокУслуг
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокУслуг.Услуга";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение 				= Движения.Продажи.Добавить();
		Движение.Период 		= Дата;
		Движение.Контрагент 	= Клиент;		
		Движение.Номенклатура 	= ВыборкаДетальныеЗаписи.Товар;
		Движение.Количество 	= ВыборкаДетальныеЗаписи.КоличествоТовар;
		Движение.Сумма 			= ВыборкаДетальныеЗаписи.Сумма;
		Движение.Номенклатура 	= ВыборкаДетальныеЗаписи.Услуга;
		Движение.Количество 	= ВыборкаДетальныеЗаписи.КоличествоУслуга;
		Движение.Сумма 			= ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

