#Область СлужебныеПроцедурыИФункции
Процедура ОбработкаПроведения(Отказ,Режим)
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров из СписокТоваров Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокТоваров.Товар;
		Движение.Контрагент = Клиент;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
		Движение.Сумма = ТекСтрокаСписокТоваров.Сумма;
	КонецЦикла;

	Для Каждого ТекСтрокаСписокУслуг из СписокУслуг Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокУслуг.Услуга;
		Движение.Контрагент = Клиент;
		Движение.Количество = 1;
		Движение.Сумма = ТекСтрокаСписокУслуг.Сумма;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

