
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	Объект.Фамилия = СокрЛП(Объект.Фамилия);
	ФИОПриИзменении();
		
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	Объект.Имя = СокрЛП(Объект.Имя);
	ФИОПриИзменении();
		
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	Объект.Отчество = СокрЛП(Объект.Отчество);
	ФИОПриИзменении();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ФИОПриИзменении()
	
	Объект.Наименование = СтрШаблон("%1 %2.%3.", Объект.Фамилия, 
									Лев(Объект.Имя, 1), 
									Лев(Объект.Отчество, 1));
		
КонецПроцедуры

#КонецОбласти