#Область СлужебныеПроцедурыИФункции

Процедура СортировкаМассива() Экспорт
	
	СотрудникиКомпании = Новый Массив;
	
	СотрудникиКомпании.Добавить("Иванов");
	СотрудникиКомпании.Добавить("Арбузов");
	СотрудникиКомпании.Добавить("Платформов");
	СотрудникиКомпании.Добавить("Физиков");
	СотрудникиКомпании.Добавить("Юриков");
	СотрудникиКомпании.Добавить("Бобров");
	СотрудникиКомпании.Добавить("Федотов");

	Для Индекс = 0 По СотрудникиКомпании.ВГраница() Цикл
		
		ЗначениеЯчейки 	= (СотрудникиКомпании.Получить(Индекс));
		СтрокаВывода 	= СтрШаблон("Ячейка с номером [%1] имеет значение ""%2""", 
						Индекс, ЗначениеЯчейки);
		
		Сообщить(СтрокаВывода);
		
	КонецЦикла;

	СписокСотрудников = Новый СписокЗначений();
	СписокСотрудников.ЗагрузитьЗначения(СотрудникиКомпании);
	СписокСотрудников.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	СотрудникиКомпании =СписокСотрудников.ВыгрузитьЗначения();
		
	Для Индекс = 0 По СотрудникиКомпании.ВГраница() Цикл
		
		ЗначениеЯчейки 	= (СотрудникиКомпании.Получить(Индекс));
		СтрокаВывода 	= СтрШаблон("Ячейка с номером [%1] имеет значение ""%2""", 
						Индекс, ЗначениеЯчейки);
		
		Сообщить(СтрокаВывода);
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьСтруктуру() Экспорт
	
	ОписаниеСотрудника = Новый Структура ("Фамилия, Имя, Отчество, ДатаРождения", 
						"Иванов", "Владимир", "Михайлович", '1997-01-09');
	
	СтрокаВывода = СтрШаблон("%1 %2.%3. = %4 лет", 
							ОписаниеСотрудника.Фамилия, 
							Лев(ОписаниеСотрудника.Имя,1), 
							Лев(ОписаниеСотрудника.Отчество,1), 
							Цел(Год(ТекущаяДата()) - Год(ОписаниеСотрудника.ДатаРождения)));
		
	Сообщить(СтрокаВывода);
			
КонецПроцедуры

#КонецОбласти