#Область СлужебныеПроцедурыИФункции

Процедура СортировкаМассива() Экспорт
	
	СотрудникиКомпании = Новый Массив;
	
	СотрудникиКомпании.Добавить("Иванов");
	СотрудникиКомпании.Добавить("Арбузов");
	СотрудникиКомпании.Добавить("Платформов");
	СотрудникиКомпании.Добавить("Физиков");
	СотрудникиКомпании.Добавить("Юриков");
	СотрудникиКомпании.Добавить("Бобров");
	СотрудникиКомпании.Добавить("Федотов");

	Для Индекс = 0 По СотрудникиКомпании.ВГраница() Цикл
		
		ЗначениеЯчейки 	= (СотрудникиКомпании.Получить(Индекс));
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст	= СтрШаблон("Ячейка с номером [%1] имеет значение ""%2""", 
						Индекс, ЗначениеЯчейки);
		Сообщение.Сообщить();
		
	КонецЦикла;

	СписокСотрудников = Новый СписокЗначений();
	СписокСотрудников.ЗагрузитьЗначения(СотрудникиКомпании);
	СписокСотрудников.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	СотрудникиКомпании =СписокСотрудников.ВыгрузитьЗначения();
		
	Для Индекс = 0 По СотрудникиКомпании.ВГраница() Цикл
		
		ЗначениеЯчейки 	= (СотрудникиКомпании.Получить(Индекс));
		
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Ячейка с номером [%1] имеет значение ""%2""", 
						Индекс, ЗначениеЯчейки);
		
		Сообщение.Сообщить();
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьСтруктуру() Экспорт
	
	МоментНачалаРасчета = ТекущаяДата();
	
	ОписаниеСотрудника = Новый Структура;
	ОписаниеСотрудника.Вставить("Фамилия", "Иванов");					
	ОписаниеСотрудника.Вставить("Имя", "Владимир");	
	ОписаниеСотрудника.Вставить("Отчество", "Михайлович");	
	ОписаниеСотрудника.Вставить("ДатаРождения", '1997-01-09');			

	Сообщение 		= Новый СообщениеПользователю();	
	Сообщение.Текст = СтрШаблон("%1 %2.%3. = %4 лет", 
							ОписаниеСотрудника.Фамилия, 
							Лев(ОписаниеСотрудника.Имя,1), 
							Лев(ОписаниеСотрудника.Отчество,1), 
							Цел(Год(МоментНачалаРасчета) - Год(ОписаниеСотрудника.ДатаРождения)));
		
	Сообщение.Сообщить();
			
КонецПроцедуры

#КонецОбласти