#Область ПрограммныйИнтерфейс

// Пересчет строки документа.
// Заполняет цены в строке табличной части
// Параметры:
// ТекущаяСтрока - СтрокаТабличнойЧасти.
Процедура ПересчетСтрокиДокумента(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
КонецПроцедуры

// Сообщение пользователю.
// 
// Параметры:
// Текст - Строка.
Процедура СообщитьПользователюКлиент(Текст) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Текст);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
