#Область ПрограммныйИнтерфейс

// Пересчет строки документа.
// Заполняет цены в строке табличной части
// Параметры:
// ТекущаяСтрока - СтрокаТабличнойЧасти.
Процедура ПересчетСтрокиДокумента(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
КонецПроцедуры

// Сообщение пользователю.
// 
// Параметры:
// Текст - Строка.
Процедура СообщениеПользователюКлиент(Текст) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Текст);
	Сообщение.Сообщить();
	
КонецПроцедуры

// Обработка открытия формы выбора.
// 
// Параметры:
// НаименованиеСтруктуры - Структура
// ФормаВыбора - Форма
// ЭлементФормы - ПолеФормы
// ПараметрОтбора - Структура
Процедура ФормированиеИОткрытиеФормы(НаименованиеСтруктуры, ФормаВыбора, ЭлементФормы, ПараметрОтбора) Экспорт
	
    ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить(ПараметрОтбора, НаименованиеСтруктуры);
    
    СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", ПараметрыОтбора);
	СтруктураПараметров.Вставить("РежимВыбора", Истина); 

    ОткрытьФорму(ФормаВыбора, СтруктураПараметров, ЭлементФормы);
    
КонецПроцедуры

#КонецОбласти
