#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура РасчитатьИтоговуюЦену(Команда)
	ПроверитьЗапонениеСебестоимости();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПроверитьЗапонениеСебестоимости()
	Если НЕ ЗначениеЗаполнено(Объект.СебестоимостьТовара) Тогда
		Сообщить ("Себестоимость товара не указана");	
		Возврат;
	КонецЕсли;
	
	РасчетИтоговойЦены();
КонецПроцедуры

&НаКлиенте
Процедура РасчетИтоговойЦены()
	Объект.ИтоговаяЦена = (Объект.СебестоимостьТовара * (1 + (Объект.Наценка / 100))) 
						* (1 + (Объект.СтавкаНДС / 100));
	Сообщить (СтрШаблон("Итоговая цена = %1", Объект.ИтоговаяЦена));
КонецПроцедуры
#КонецОбласти