#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
    КонецЕсли;
		
	ЭтоРегистрационныйНомер(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЭтоРегистрационныйНомер(Отказ)
	
	Если НЕ СтрПодобнаПоРегулярномуВыражению(РегистрационныйНомер, 
			"[ABCEHKMOPTXY]{1}\d{3}[ABCEHKMOPTXY]{2}\s\d{2,3}....") Тогда

		Текст = "Для заполнения поля регистрационный номер 
				|используйте заглавные буквы латинкого алфавита!";
		ОбщегоНазначенияВызовСервера.СообщитьПользователюСервер(Текст);
		Отказ = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли