
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ТранспортСБригадой 		= ТранспортСБригадой(Объект.Дата);
	ТранспортныйОтделКлиент.ОткрытьФормуВыбора(ТранспортСБригадой, 
												"Справочник.ТранспортныеСредства.ФормаВыбора", 
												Элементы.Транспорт, 
												"Наименование")
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, 
									ВыборДобавлением, СтандартнаяОбработка)
    СтандартнаяОбработка 	= Ложь;
    Объект.Транспорт 	= ВыбранноеЗначение;
	БригадаЗакрепленнаяЗаТранспортом(Объект.Дата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТранспортСБригадой(Знач Дата)
	
	ТранспортСБригадой = Новый СписокЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставБригады.Транспорт
	|ИЗ
	|	РегистрСведений.СоставБригады КАК СоставБригады
	|ГДЕ
	|	СоставБригады.Период = &Период
	|	И СоставБригады.Транспорт НЕ В
	|		(ВЫБРАТЬ
	|			СостояниеДоставки.Транспорт
	|		ИЗ
	|			РегистрСведений.СостояниеДоставки КАК СостояниеДоставки
	|		ГДЕ
	|			СостояниеДоставки.Период = &Период
	|			И СостояниеДоставки.СостояниеЗаказа <> &СостояниеЗаказа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоставБригады.Транспорт.Представление";
	
	Запрос.УстановитьПараметр("СостояниеЗаказа", Перечисления.СостояниеЗаказа.Отработан);
	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
	РезультатЗапроса = Запрос.Выполнить();
	Текст = "Состав бригады не назначен!";
	Выборка = ТранспортныйОтделСервер.ВыборкаРезультатаЗапроса(РезультатЗапроса, Текст);
	ТранспортСБригадой = ТранспортныйОтделСервер.НоваяСтруктураОтбора(Выборка, Выборка.Транспорт);
	
	Возврат ТранспортСБригадой;

КонецФункции

&НаСервере
Процедура БригадаЗакрепленнаяЗаТранспортом(Знач Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставБригады.Водитель,
	|	СоставБригады.ГрузчикПервый,
	|	СоставБригады.ГрузчикВторой,
	|	СоставБригады.НачальныйПробег
	|ИЗ
	|	РегистрСведений.СоставБригады КАК СоставБригады
	|ГДЕ
	|	СоставБригады.Период = &Период
	|	И СоставБригады.Транспорт = &Транспорт";
	
	Запрос.УстановитьПараметр("Транспорт", Объект.Транспорт);
	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
	РезультатЗапроса = Запрос.Выполнить();
	
	Текст = "Состав бригады не назначен!";
	Выборка = ТранспортныйОтделСервер.ВыборкаРезультатаЗапроса(РезультатЗапроса, Текст);
	
	Выборка.Следующий();
	Объект.Водитель = Выборка.Водитель;
	Объект.ГрузчикПервый = Выборка.ГрузчикПервый;
	Объект.ГрузчикВторой = Выборка.ГрузчикВторой;
	Объект.НачальныйПробег = Выборка.НачальныйПробег;

КонецПроцедуры

#КонецОбласти
