
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортНачалоВыбора(Элемент, ДанныеВыбора, 
	ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ТранспортныйОтделКлиент.ОткрытьФормуВыбора(НачалоДня(Объект.Дата), 
	"Справочник.Водители.Форма.ФормаВыбораТранспортСБригадой", Элементы.Транспорт, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, 
									ВыборДобавлением, СтандартнаяОбработка)
    СтандартнаяОбработка 	= Ложь;
    Объект.Транспорт 	= ВыбранноеЗначение;
	БригадаЗакрепленнаяЗаТранспортом(Объект.Дата);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура БригадаЗакрепленнаяЗаТранспортом(Знач Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставБригады.Водитель,
	|	СоставБригады.ГрузчикПервый,
	|	СоставБригады.ГрузчикВторой,
	|	СоставБригады.НачальныйПробег
	|ИЗ
	|	РегистрСведений.СоставБригады КАК СоставБригады
	|ГДЕ
	|	СоставБригады.Период = &Период
	|	И СоставБригады.Транспорт = &Транспорт";
	
	Запрос.УстановитьПараметр("Транспорт", Объект.Транспорт);
	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
	РезультатЗапроса = Запрос.Выполнить();
	
	Текст = "Состав бригады не назначен!";
	Выборка = ТранспортныйОтделСервер.ВыборкаРезультатаЗапроса(РезультатЗапроса, Текст);
	
	Выборка.Следующий();
	Объект.Водитель = Выборка.Водитель;
	Объект.ГрузчикПервый = Выборка.ГрузчикПервый;
	Объект.ГрузчикВторой = Выборка.ГрузчикВторой;
	Объект.НачальныйПробег = Выборка.НачальныйПробег;

КонецПроцедуры

#КонецОбласти
