#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьФайлВБазу(ОбъектЗаписи, ДанныеФайла, РасширениеФайла, РазмерФайла) Экспорт
	
	АлгоритмСжатия 		= Новый СжатиеДанных(9);
	ХранилищеСФайлом 	= Новый ХранилищеЗначения(ДанныеФайла, АлгоритмСжатия);
	
	ЗаписьФайла 			= СоздатьМенеджерЗаписи();
	ЗаписьФайла.Объект 		= ОбъектЗаписи;
	ЗаписьФайла.ДанныеФайла = ХранилищеСФайлом;
	ЗаписьФайла.Расширение 	= РасширениеФайла;
	ЗаписьФайла.РазмерФайла = РазмерФайла;
	
	ЗаписьФайла.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьДанныеФайла(ОбъектЧтение) Экспорт

	ЧтениеФайла 		= СоздатьМенеджерЗаписи();
	ЧтениеФайла.Объект 	= ОбъектЧтение;	
	ЧтениеФайла.Прочитать();    
	
	ДанныеФайла = ЧтениеФайла.ДанныеФайла.Получить();
	
	Возврат ДанныеФайла;

КонецФункции 

#КонецЕсли

#КонецОбласти