#Область ПрограммныйИнтерфейс

// Сообщение пользователю.
// 
// Параметры:
// Текст - Строка.
Процедура СообщитьПользователюСервер(Текст) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Текст);
	Сообщение.Сообщить();
	
КонецПроцедуры

// Удаление непроверяемых реквизитов из массива ПроверяемыеРеквизиты.
// 
// Параметры:
// МассивРеквизитов - Массив.
// МассивНепроверяемыхРеквизитов - Массив.
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры

#КонецОбласти
