
#Область ПрограммныйИнтерфейс
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// Сформировать печатные формы объектов
//
// Выполняет подготовку данных и заполнение макета печать справочника Номенклатура
// Параметры:
//   ТабДок - ТаблицаЗначений. 
//   Ссылка - ДокументСсылка. 
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет 	= ПолучитьМакет("Печать");
	Запрос 	= Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.ВидНоменклатуры,
	|	Номенклатура.Код,
	|	Номенклатура.Наименование,
	|	Номенклатура.ОсновнаяЕдиницаИзмерения,
	|	Номенклатура.ЦенаПокупки,
	|	Номенклатура.ЦенаПродажи
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	Шапка 				= Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
#КонецЕсли
#КонецОбласти
