
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинкиВХранилище) Тогда
		
		ДанныеКартинки = ПолучитьИзВременногоХранилища(АдресКартинкиВХранилище);
			
			Если ДанныеКартинки = Неопределено Тогда
				
				Сообщение 		= Новый СообщениеПользователю();
				Сообщение.Текст = "При сохранении произшла ошибка!";
				Сообщение.Сообщить();
				
			Иначе
				
				РегистрыСведений.Файлы.ЗаписатьФайлВБазу(	ТекущийОбъект.Ссылка, 
															ДанныеКартинки, 
															РасширениеФайлаКартинки, 
															РазмерФайлаКартинки);
				
			КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДанныеКартинки = РегистрыСведений.Файлы.ПолучитьДанныеФайла(ТекущийОбъект.Ссылка);
	
		Если ДанныеКартинки <> Неопределено Тогда
			
			АдресКартинкиВХранилище = ПоместитьВоВременноеХранилище
									(ДанныеКартинки, УникальныйИдентификатор)
			
		КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресКартинкиВХранилищеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПрикрепитьФайлКартинкиАсинх();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
АСИНХ Процедура ПрикрепитьФайлКартинкиАсинх()
	
	ИмяФайлаКартинки = ЖДАТЬ РаботаСФайламиКлиент.ПолучитьИмяЗагружаемогоФайлаАсинх();
	
		Если ПустаяСтрока(ИмяФайлаКартинки) = Ложь Тогда
			
			ОписаниеФайла = ЖДАТЬ РаботаСФайламиКлиент.ПолучитьОписаниеФайлаАсинх(ИмяФайлаКартинки);
			
			РасширениеФайлаКартинки 	= ОписаниеФайла.Расширение;
			РазмерФайлаКартинки 		= ОписаниеФайла.Размер;
			
			ОписаниеПомещаемогоФайла = ЖДАТЬ ПоместитьФайлНаСерверАсинх
												(, , , ИмяФайлаКартинки, 
												УникальныйИдентификатор);
			АдресКартинкиВХранилище = ОписаниеПомещаемогоФайла.Адрес;
			
		КонецЕсли;
	
КонецПроцедуры

#КонецОбласти