#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.Зарплата.Записывать 	= Истина;
	Движение 						= Движения.Зарплата.Добавить();
	Движение.Сторно 				= Ложь;
	Движение.ВидРасчета 			= ПланыВидовРасчета.ВидыРасчета.Прогул;
	Движение.ПериодРегистрации 		= Дата;
	Движение.ПериодДействияНачало 	= НачалоДня(Дата);
	Движение.ПериодДействияКонец 	= КонецДня(Дата);
	Движение.Сотрудник 				= Сотрудник;

КонецПроцедуры

#КонецЕсли

#КонецОбласти