
#Область ОбработчикиСобытий
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)    
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
 	Поля.Добавить("Телефон");
	
КонецПроцедуры                       

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
		Если ЗначениеЗаполнено(Данные.Телефон) Тогда
			Представление = Данные.Наименование + " (" + Строка(Данные.Телефон) + ")";
		Иначе
			Представление = Данные.Наименование;  
		КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
