#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
    КонецЕсли;
		
	ЭтоФамилияИмяОтчество(Отказ);
	ЭтоДатаРождения(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Процедура ЭтоФамилияИмяОтчество(Отказ)
	
	Если НЕ ((СтрПодобнаПоРегулярномуВыражению(Фамилия, "[А-Я]{1}[а-яё]+") ИЛИ
		СтрПодобнаПоРегулярномуВыражению(Фамилия, "[А-Я]{1}[а-яё]+[-]{1}[А-Я]{1}[а-яё]+")) И
		СтрПодобнаПоРегулярномуВыражению(Имя, "[А-Я]{1}[а-яё]+") И
		СтрПодобнаПоРегулярномуВыражению(Отчество, "[А-Я]{1}[а-яё]+")) Тогда
		
		Текст = "Поля Фамилия, Имя, Отчество должны быть
				|заполнены буквами русского алфавита и
				|начинаться с заглавной буквы";
		ОбщегоНазначенияВызовСервера.СообщитьПользователюСервер(Текст);
		Отказ = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЭтоДатаРождения(Отказ)
	
	Если ДатаРождения = Неопределено ИЛИ
		ДатаРождения = '0001.01.01' ИЛИ
		ДатаРождения > ТекущаяДатаСеанса() Тогда
		
		Текст = "Поле Дата рождения должно быть заполнено";
		ОбщегоНазначенияВызовСервера.СообщитьПользователюСервер(Текст);
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли