
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТоваров

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры


&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПроцентСкидкиПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетСтрокиТоваровСписокТоваров()
	
	СтрокаРасчета 		= Элементы.СписокТоваров.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * (1 - (СтрокаРасчета.ПроцентСкидки / 100)) 
						* СтрокаРасчета.Количество;
						
КонецПроцедуры

#КонецОбласти