
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокТоваров

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПроцентСкидкиПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокТоваров()
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварПриИзменении(Элемент)

	СтрокаРасчета = Элементы.СписокТоваров.ТекущиеДанные;
	СтрокаРасчета.Цена = ПолучитьАктуальнуюЦенуНоменклатуры(СтрокаРасчета.Товар, Объект.Дата);
	РасчетСтрокиТоваровСписокТоваров();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокУслуг

&НаКлиенте
Процедура СписокУслугУслугаПриИзменении(Элемент)

	СтрокаРасчета = Элементы.СписокУслуг.ТекущиеДанные;
	СтрокаРасчета.Сумма = ПолучитьАктуальнуюЦенуНоменклатуры(СтрокаРасчета.Услуга, Объект.Дата);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетСтрокиТоваровСписокТоваров()
	
	СтрокаРасчета 		= Элементы.СписокТоваров.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * (1 - (СтрокаРасчета.ПроцентСкидки / 100)) 
						* СтрокаРасчета.Количество;
						
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАктуальнуюЦенуНоменклатуры(Номенклатура, ПериодОтбора)
	
	Возврат РегистрыСведений.ЦенаНоменклатуры.ПолучитьАктуальнуюЦену(Номенклатура, ПериодОтбора);

КонецФункции

#КонецОбласти