
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВвестиДатуРождения()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВвестиДатуРождения()
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтотОбъект);
	ПоказатьВводДаты(Оповещение, , "Введите Вашу дату рождения", ЧастиДаты.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(ДатаРождения, Параметры) Экспорт
	Если ДатаРождения = Неопределено ИЛИ ДатаРождения > ТекущаяДата() Тогда
		Сообщить("Введена неверная дата");
		Возврат;
	КонецЕсли;
	Объект.ДатаРождения = ДатаРождения;
	РсчитатьКоличествоНедель (ДатаРождения);
КонецПроцедуры


&НаКлиенте
Процедура РсчитатьКоличествоНедель (ДатаРождения) 
	Объект.КоличествоНедель = Цел((ТекущаяДата() - ДатаРождения)/(60*60*24*7));
	Сообщить (СтрШаблон("Вам от роду %1 недель", Объект.КоличествоНедель));
	
КонецПроцедуры
#КонецОбласти