#Область ОписаниеПеременных
 
&НаКлиенте
Перем МоментНачалаРасчета;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВвестиДатуРождения()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВвестиДатуРождения()
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтотОбъект);
	ПоказатьВводДаты(Оповещение, , "Введите Вашу дату рождения", ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(ДатаРождения, Параметры) Экспорт

	МоментНачалаРасчета = ТекущаяДата();
	
	Если ДатаРождения = Неопределено ИЛИ ДатаРождения > МоментНачалаРасчета Тогда
		
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = "Введена неверная дата";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Объект.ДатаРождения = ДатаРождения;
	РсчитатьКоличествоНедель (ДатаРождения);
	
КонецПроцедуры


&НаКлиенте
Процедура РсчитатьКоличествоНедель (ДатаРождения)

	МоментНачалаРасчета = ТекущаяДата();
	 
	Объект.КоличествоНедель = Цел((МоментНачалаРасчета - ДатаРождения) / (60 * 60 * 24 * 7));

	Сообщение 		= Новый СообщениеПользователю();
	Сообщение.Текст = СтрШаблон("Вам от роду %1 недель", Объект.КоличествоНедель);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти