#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказПоставщикуСписокМатериалов.Ссылка,
			|	ЗаказПоставщикуСписокМатериалов.Ссылка.Поставщик,
			|	ЗаказПоставщикуСписокМатериалов.Ссылка.Договор,
			|	ЗаказПоставщикуСписокМатериалов.Материал КАК Материал,
			|	ЗаказПоставщикуСписокМатериалов.Цена,
			|	ЗаказПоставщикуСписокМатериалов.Количество,
			|	ЗаказПоставщикуСписокМатериалов.Сумма,
			|	0 КАК Расходник
			|ИЗ
			|	Документ.ЗаказПоставщику.СписокМатериалов КАК ЗаказПоставщикуСписокМатериалов
			|ГДЕ
			|	ЗаказПоставщикуСписокМатериалов.Ссылка = &ДанныеЗаполнения
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказПоставщикуСписокРасходников.Ссылка,
			|	ЗаказПоставщикуСписокРасходников.Ссылка.Поставщик,
			|	ЗаказПоставщикуСписокРасходников.Ссылка.Договор,
			|	0,
			|	ЗаказПоставщикуСписокРасходников.Цена,
			|	ЗаказПоставщикуСписокРасходников.Количество,
			|	ЗаказПоставщикуСписокРасходников.Сумма,
			|	ЗаказПоставщикуСписокРасходников.Расходник
			|ИЗ
			|	Документ.ЗаказПоставщику.СписокРасходников КАК ЗаказПоставщикуСписокРасходников
			|ГДЕ
			|	ЗаказПоставщикуСписокРасходников.Ссылка = &ДанныеЗаполнения";
		
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();
		
			Если РезультатЗапроса.Пустой() Тогда
				
				Возврат;
				
			КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
				Договор   = ВыборкаДетальныеЗаписи.Договор;
				Поставщик = ВыборкаДетальныеЗаписи.Поставщик;
				Основание = ВыборкаДетальныеЗаписи.Ссылка;
						
				Если ВыборкаДетальныеЗаписи.Расходник = 0 Тогда
					
					НоваяСтрока = СписокМатериалов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
					
				ИначеЕсли ВыборкаДетальныеЗаписи.Материал = 0 Тогда
					
					НоваяСтрока = СписокРасходников.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
					
				КонецЕсли;
							
			КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ,Режим)

	Запрос = Новый Запрос;
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяСписокМатериалов.Материал КАК Номенклатура,
		|	СУММА(ПриходнаяНакладнаяСписокМатериалов.Количество) КАК Количество,
		|	ПриходнаяНакладнаяСписокМатериалов.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.ПриходнаяНакладная.СписокМатериалов КАК ПриходнаяНакладнаяСписокМатериалов
		|ГДЕ
		|	ПриходнаяНакладнаяСписокМатериалов.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяСписокМатериалов.Ссылка.Дата,
		|	ПриходнаяНакладнаяСписокМатериалов.Материал
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриходнаяНакладнаяСписокРасходников.Расходник,
		|	СУММА(ПриходнаяНакладнаяСписокРасходников.Количество),
		|	ПриходнаяНакладнаяСписокРасходников.Ссылка.Дата
		|ИЗ
		|	Документ.ПриходнаяНакладная.СписокРасходников КАК ПриходнаяНакладнаяСписокРасходников
		|ГДЕ
		|	ПриходнаяНакладнаяСписокРасходников.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяСписокРасходников.Ссылка.Дата,
		|	ПриходнаяНакладнаяСписокРасходников.Расходник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
		Если РезультатЗапроса.Пустой() Тогда
			
			Возврат;
			
		КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);			
				
		КонецЦикла;

КонецПроцедуры

#КонецЕсли

#КонецОбласти

