#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)

	ТекущаяСтрока 		= Элементы.Услуги.ТекущиеДанные;
	ТекущаяСтрока.Цена 	= ОбщегоНазначенияВызовСервера.ПолучитьЦенуПродажиНоменклатуры(ТекущаяСтрока.Номенклатура);
	ОбщегоНазначенияКлиент.ПересчетСтрокиДокумента(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ПересчетСтрокиДокумента(Элементы.Услуги.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ПересчетСтрокиДокумента(Элементы.Услуги.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока 		= Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Цена 	= ОбщегоНазначенияВызовСервера.ПолучитьЦенуПродажиНоменклатуры(ТекущаяСтрока.Номенклатура);
	ОбщегоНазначенияКлиент.ПересчетСтрокиДокумента(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ПересчетСтрокиДокумента(Элементы.Товары.ТекущиеДанные);
	ПроверкаСуммыПокупки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ПересчетСтрокиДокумента(Элементы.Товары.ТекущиеДанные);
	ПроверкаСуммыПокупки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаСуммыПокупки()
	
	Если Объект.Товары.Итог("Сумма") > 1000 Тогда
		Текст = "Покупателю доступна бесплатная услуга доставки товара";
		ОбщегоНазначенияКлиент.СообщитьПользователюКлиент(Текст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
