
#Область ПрограммныйИнтерфейс
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Сформировать печатные формы объектов
//
// Выполняет подготовку данных и заполнение макета печать справочника Номенклатура
// Параметры:
//   ТабДок - ТаблицаЗначений. 
//   Ссылка - ДокументСсылка. 
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаТранспорт.Номер КАК Номер,
	|	ЗаявкаНаТранспорт.Дата КАК Дата,
	|	ЗаявкаНаТранспорт.Контрагент КАК Контрагент,
	|	ЗаявкаНаТранспорт.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЗаявкаНаТранспорт.КонтактноеЛицо.Адрес КАК Адрес,
	|	ЗаявкаНаТранспорт.ДатаДоставки КАК ДатаДоставки,
	|	ЗаявкаНаТранспорт.Транспорт КАК Транспорт,
	|	ЗаявкаНаТранспорт.Водитель КАК Водитель,
	|	ЗаявкаНаТранспорт.ГрузчикВторой КАК ГрузчикВторой,
	|	ЗаявкаНаТранспорт.ГрузчикПервый КАК ГрузчикПервый,
	|	ЗаявкаНаТранспорт.Основание.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения) КАК Основание
	|ИЗ
	|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
	|ГДЕ
	|	ЗаявкаНаТранспорт.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок 	= Макет.Области.Найти("Заголовок");
		Если ОбластьЗаголовок <> Неопределено Тогда
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьЗаголовок);
		КонецЕсли;
		
		ОбластьШапка 		= Макет.Области.Найти("Шапка");
		Если ОбластьШапка <> Неопределено Тогда
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьШапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьШапка, Выборка.Уровень());
		КонецЕсли;
		
		ОбластьТоварыШапка 	= Макет.Области.Найти("ТоварыШапка");
		Если ОбластьТоварыШапка <> Неопределено Тогда		
			ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
			ТабДок.Вывести(ОбластьТоварыШапка);
		КонецЕсли;	
				
		ОбластьТовары 		= Макет.Области.Найти("Товары");
		Если ОбластьТовары <> Неопределено Тогда	
			ОбластьТовары = Макет.ПолучитьОбласть("Товары");  	
			ВыборкаТовары = Выборка.Основание.Выбрать();
			Пока ВыборкаТовары.Следующий() Цикл
				ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
				ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			КонецЦикла;
		КонецЕсли;	
		
		ОбластьПодвал 		= Макет.Области.Найти("Подвал");
		Если ОбластьПодвал <> Неопределено Тогда	
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");		
			ТабДок.Вывести(ОбластьПодвал);
		КонецЕсли;
				
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли	
#КонецОбласти