#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	ПроверяемыеРеквизиты = ЗаполнениеПроверяемыхРеквизитов();
	ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты);
	ВыборкаДетальныеЗаписи = ПолучениеДанныхДвижений(Отказ);
	ЗаписьДвижений(ВыборкаДетальныеЗаписи);

КонецПроцедуры
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	
	РезультатЗапроса = ПолучениеДанныхЗаполнения(ДанныеЗаполнения);
	ЗаписьДанныхЗаполнения(РезультатЗапроса);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Условие = (Расстояние = 0);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле Расстояние должно быть заполнено");	
	
	Условие = ДатаДоставки < ТекущаяДатаСеанса();
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Дата плановой доставки не может быть в прошедшем периоде");		
	
	Условие = НЕ ЗначениеЗаполнено(Контрагент);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле Контрагент должно быть заполнено");			
	
	Условие = НЕ ЗначениеЗаполнено(КонтактноеЛицо);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле Контакное лицо должно быть заполнено");				
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Условие = НЕ ЗначениеЗаполнено(Транспорт);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле Транспорт должно быть заполнено");				
	
	Условие = НЕ ЗначениеЗаполнено(Водитель);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле Водитель должно быть заполнено");				
		
	Условие = НЕ ЗначениеЗаполнено(ГрузчикПервый);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле ГрузчикПервый должно быть заполнено");				
	
	Условие = НЕ ЗначениеЗаполнено(ГрузчикВторой);
	ОбщегоНазначенияВызовСервера.ПроверкаУсловий(Отказ, Условие, "Поле ГрузчикВторой должно быть заполнено");				
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучениеДанныхДвижений(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаНаТранспорт.Дата КАК Период,
		|	ЗаявкаНаТранспорт.Транспорт КАК Транспорт,
		|	ЗаявкаНаТранспорт.Водитель КАК Водитель,
		|	ЗаявкаНаТранспорт.ГрузчикПервый КАК ГрузчикПервый,
		|	ЗаявкаНаТранспорт.ГрузчикВторой КАК ГрузчикВторой,
		|	ЗаявкаНаТранспорт.СостояниеЗаказа КАК СостояниеЗаказа,
		|	ЗаявкаНаТранспорт.Расстояние КАК Расстояние,
		|	ЗаявкаНаТранспорт.НачальныйПробег,
		|	ЗаявкаНаТранспорт.КонтактноеЛицо.Адрес КАК АдресДоставки,
		|	1 КАК Рейсы
		|ИЗ
		|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
		|ГДЕ
		|	ЗаявкаНаТранспорт.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Процедура ЗаписьДвижений(ВыборкаДетальныеЗаписи)
	
	Движения.ПробегТранспорта.Записывать 	= Истина;
	Движения.СостояниеДоставки.Записывать 	= Истина;
	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	Движение = Движения.СостояниеДоставки.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);	
	
	Если ВыборкаДетальныеЗаписи.СостояниеЗаказа <> Перечисления.СостояниеЗаказа.Отработан Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ПробегТранспорта.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	
КонецПроцедуры

Функция ПолучениеДанныхЗаполнения(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаТоваров") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПродажаТоваров.Ссылка КАК Основание,
			|	ПродажаТоваров.Контрагент,
			|	ПродажаТоваров.КонтактноеЛицо,
			|	ПродажаТоваров.СуммаДокумента,
			|	ПродажаТоваров.КонтактноеЛицо.Адрес КАК Адрес
			|ИЗ
			|	Документ.ПродажаТоваров КАК ПродажаТоваров
			|ГДЕ
			|	ПродажаТоваров.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();
			
	Возврат РезультатЗапроса;

	КонецЕсли;
	
КонецФункции

Процедура ЗаписьДанныхЗаполнения(РезультатЗапроса)
	
	Если НЕ ЗначениеЗаполнено(РезультатЗапроса) Тогда
		Текст = "Ввод Заявки на транспорт не возможен! 
				|Документ основание не заполнен";
		ОбщегоНазначенияВызовСервера.СообщениеПользователюСервер(Текст);
		Возврат;
	КонецЕсли;
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Если ВыборкаДетальныеЗаписи.СуммаДокумента < 1000 Тогда
		Текст = "Ввод Заявки на транспорт не возможен! 
				|Сумма заказа менее 1000 рублей!";
		ОбщегоНазначенияВызовСервера.СообщениеПользователюСервер(Текст);
		Возврат;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	
КонецПроцедуры

Функция ЗаполнениеПроверяемыхРеквизитов();
	
	ПроверяемыеРеквизиты = Новый Массив;
	Возврат ПроверяемыеРеквизиты;
		
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли