#Область ПрограммныйИнтерфейс

// Проверка результата запроса - выполняет проверку наличия результата запроса, возвращает выборку.
// 
// Параметры:
// РезультатЗапроса - Структура.
// Текст - Строка.
// 
// Возвращаемое значение:
// Структура 
Функция ВыборкаРезультатаЗапроса(РезультатЗапроса, Текст) Экспорт
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияСервер.СообщитьПользователюСервер(Текст);
	КонецЕсли;
	
	Выборка	= РезультатЗапроса.Выбрать();
	Возврат Выборка;
		
КонецФункции

// НоваяСтруктураОтбора - возвращает Структуру для открытия Формы выбора.
// 
// Параметры:
// Выборка - Структура.
// Параметр - СправочникСсылка
// 
// Возвращаемое значение:
// СписокЗначений.
// СтрокаТаблицыЗначений.
Функция НоваяСтруктураОтбора(Выборка, Параметр) Экспорт
	
	НаименованиеСтруктуры = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		НаименованиеСтруктуры.Добавить(Строка(Параметр));
	КонецЦикла;
	
	Возврат НаименованиеСтруктуры;	
	
КонецФункции

// Проверка условий - выполняет проверку условий перед записью или проведением.
// 
// Параметры:
// Отказ - Булево.
// Условие - Булево.
// Текст - Строка.
Процедура ПроверитьУсловие (Отказ, Условие, Текст) Экспорт
	
	Если Условие Тогда 
		ОбщегоНазначенияСервер.СообщитьПользователюСервер(Текст);
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
