#Область ПрограммныйИнтерфейс

// Проверка результата запроса - выполняет проверку наличия результата запроса, возвращает выборку.
// 
// Параметры:
// РезультатЗапроса - Структура.
// Текст - Строка.
// 
// Возвращаемое значение:
// Структура 
Функция ВыборкаРезультатаЗапроса(РезультатЗапроса, Текст) Экспорт
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияСервер.СообщитьПользователюСервер(Текст);
	КонецЕсли;
	
	Выборка	= РезультатЗапроса.Выбрать();
	Возврат Выборка;
		
КонецФункции

// Проверка условий - выполняет проверку условий перед записью или проведением.
// 
// Параметры:
// Отказ - Булево.
// Условие - Булево.
// Текст - Строка.
Процедура ПроверитьУсловие (Отказ, Условие, Текст) Экспорт
	
	Если Условие Тогда 
		ОбщегоНазначенияСервер.СообщитьПользователюСервер(Текст);
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
