
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Текст = "Поле Контрагент должно быть заполнено";
		ОбщегоНазначенияВызовСервера.СообщениеПользователюСервер(Текст);
		Отказ = Истина;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Текст = "Поле КонтактноеЛицо должно быть заполнено";
		ОбщегоНазначенияВызовСервера.СообщениеПользователюСервер(Текст);
		Отказ = Истина;
	КонецЕсли;	
		
	Если НЕ ЗначениеЗаполнено(Сотрудник)  Тогда
		Текст = "Поле Сотрудник должно быть заполнено";
		ОбщегоНазначенияВызовСервера.СообщениеПользователюСервер(Текст);
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ЦеныПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЦеныПоставщиков.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Цена = ТекСтрокаТовары.Цена;
	КонецЦикла;

	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Серия = ТекСтрокаТовары.Серия;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаТоваров") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПродажаТоваровТовары.Ссылка.Контрагент КАК Контрагент,
			|	ПродажаТоваровТовары.Ссылка.КонтактноеЛицо КАК КонтактноеЛицо,
			|	ПродажаТоваровТовары.Ссылка.Сотрудник КАК Сотрудник,
			|	ПродажаТоваровТовары.Ссылка.Склад КАК Склад,
			|	ПродажаТоваровТовары.Ссылка.СуммаДокумента КАК СуммаДокумента,
			|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
			|	ПродажаТоваровТовары.Серия КАК Серия,
			|	ПродажаТоваровТовары.Количество КАК Количество,
			|	ПродажаТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ПродажаТоваровТовары.Цена КАК Цена,
			|	ПродажаТоваровТовары.Сумма КАК Сумма
			|ИЗ
			|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
			|ГДЕ
			|	ПродажаТоваровТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
		
			Возврат;
		
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл; 
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

