#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура Рассчитать() Экспорт
	
	Для Каждого СтрокаДвижения Из ЭтотОбъект Цикл
		
		ФактЧасов = СтрокаДвижения.ПолучитьДанныеГрафика
		(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
		
		Если ФактЧасов = 0 Тогда
			
			СтрокаВывода = СтрШаблон("На период ""%1"" не заполнен производственный календарь!",
			Формат(СтрокаДвижения.ПериодДействияНачало, "ДФ = 'ММММ гггг'"));
			ВызватьИсключение СтрокаВывода;
		
		КонецЕсли;
		
		СтрокаДвижения.Сумма = СтрокаДвижения.ЧасоваяСтавка * ФактЧасов;
		
	КонецЦикла;	
		
КонецПроцедуры

#КонецЕсли

#КонецОбласти