#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЧасовуюСтавку(СотрудникОтбора, ПериодОтбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЧасоваяСтавкаСотрудникаСрезПоследних.ЧасоваяСтавка
		|ИЗ
		|	РегистрСведений.ЧасоваяСтавкаСотрудника.СрезПоследних(&ПериодСреза, Сотрудник = &Сотрудник) КАК
		|		ЧасоваяСтавкаСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("ПериодСреза", ПериодОтбора);
	Запрос.УстановитьПараметр("Сотрудник", СотрудникОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
		Если РезультатЗапроса.Пустой() Тогда
			
			ЧасоваяСтавкаСотрудника = 0;
			
		Иначе
				
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();				
			ВыборкаДетальныеЗаписи.Следующий();
			ЧасоваяСтавкаСотрудника = ВыборкаДетальныеЗаписи.ЧасоваяСтавка;
							
		КонецЕсли;
	
	Возврат ЧасоваяСтавкаСотрудника;
	
КонецФункции

#КонецОбласти