
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьПриемКлиентов(Команда)
	
	Объект.КоличествоКлиентов = 1;
	
	Пока Объект.КоличествоКлиентов < 10001 Цикл
		Если 	Объект.КоличествоКлиентов=100 
			ИЛИ Объект.КоличествоКлиентов=1000 
			ИЛИ Объект.КоличествоКлиентов=10000 Тогда
			Сообщить("Киленту №" + Объект.КоличествоКлиентов + " ЛЮКС БЕСПЛАТНО!"); 
		КонецЕсли; 
		Объект.КоличествоКлиентов = Объект.КоличествоКлиентов + 1;
	КонецЦикла;
	
	Сообщить("Мест нет");
КонецПроцедуры

#КонецОбласти