#Область СлужебныеПроцедурыИФункции

Процедура СфрормироватьТаблицуЗначений() Экспорт
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	
	ТаблицаТоваров.Колонки.Добавить("Товар");
	ТаблицаТоваров.Колонки.Добавить("Остаток");	
	
	НоваяСтрока = ТаблицаТоваров.Добавить();
	
	НоваяСтрока.Товар = "Яблоки";
	НоваяСтрока.Остаток = 10;

	НоваяСтрока = ТаблицаТоваров.Добавить();
	
	НоваяСтрока.Товар = "Яблоки";
	НоваяСтрока.Остаток = 20;
	
	НоваяСтрока = ТаблицаТоваров.Добавить();
	
	НоваяСтрока.Товар = "Груши";
	НоваяСтрока.Остаток = 5;
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		СтрокаВывода = СтрШаблон("Товар ""%1"" остаток в количестве %2 шт.", 
					СтрокаТовара.Товар, СтрокаТовара.Остаток);
		Сообщить(СтрокаВывода);
	
	КонецЦикла;
	
	ТаблицаТоваров.Свернуть("Товар", "Остаток");
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		СтрокаВывода = СтрШаблон("Товар ""%1"" остаток в количестве %2 шт.", 
					СтрокаТовара.Товар, СтрокаТовара.Остаток);
		Сообщить(СтрокаВывода);
	
	КонецЦикла;	
					
КонецПроцедуры

#КонецОбласти